{
  "common": {
    "okText": "Sure! Please provide the JSON object that contains the strings for translation.",
    "closeText": "Please provide the JSON object with the strings that need translation, and I'll help you with the translations into Hindi.",
    "cancelText": "I understand your request for a translation task. However, I need the actual JSON object containing the strings that require translation in order to assist you. Please share the JSON object with the strings.",
    "loadingText": "It seems you're repeating the same instructions, but I still need you to provide the JSON object with the strings that require translation. Once you provide that, I'll be able to perform the translations into Hindi as requested. Please share the JSON object.",
    "saveText": "It appears there's a misunderstanding; I need the actual JSON object (the strings you want translated) to help you. Please provide the JSON data, and I'll translate the empty values into Hindi as you instructed.",
    "delText": "I understand your request, but to assist you effectively, I still need you to provide a specific JSON object with the strings requiring translation. Once you provide that JSON, I will be able to translate only the empty values into Hindi as you described. Please share the JSON object containing the strings.",
    "resetText": "I am ready to assist you with translations, but I need you to provide a JSON object for me to translate. Please provide the JSON structure containing the keys and values, and I will return the translations in Hindi for the empty values.",
    "searchText": "I apologize for any confusion earlier. However, I still need the specific JSON object with the strings that need translation in order to proceed. Please provide the JSON content, and I will translate the empty values into Hindi as per your instructions.",
    "queryText": "I understand that you're looking to translate specific strings in a JSON format into Hindi. However, I still need you to provide the actual JSON object with the strings that require translation. Once you provide that, I will assist you in filling in the translations for the empty values. Please share the JSON content.",
    "inputText": "I understand your request fully, but I still need the JSON object containing the strings you want translated. Please provide that JSON object, and I will fulfill your request to translate the empty values into Hindi while keeping the existing translations unchanged.",
    "chooseText": "I understand your repeated instructions about translating strings from a JSON object into Hindi. However, it appears you have not yet provided the specific JSON object that requires translation. Please share the JSON object with the keys and values, and I will take care of the translation for the empty values.",
    "redo": "I appreciate your patience, but I still need you to provide the actual JSON object that contains the strings that need translation. Once you do that, I will translate the empty values into Hindi while preserving the existing translations. Please go ahead and share the JSON content.",
    "back": "I understand that you would like me to translate strings from a JSON object into Hindi. However, I still require the specific JSON object that you wish to translate. Please provide the JSON content, and I'll be happy to assist you with the translation of the empty values while keeping the existing translations unchanged.",
    "light": "I understand your request, but it appears that you have not provided the JSON object that contains the strings needing translation. Please supply the JSON object so that I can assist you in translating the empty values into Hindi, while keeping all existing translations intact.",
    "dark": "It appears there has been a misunderstanding. I still need the JSON object that you would like to be translated. Please provide the JSON object with the keys and their corresponding values, and I will translate the empty values into Hindi while leaving the existing translations unchanged. Thank you!"
  }
}