{
  "component": {
    "search.request": "I appreciate your persistence, but I still need the JSON object you'd like to be translated. Please provide that object, and I will translate only the empty values into Hindi while keeping the rest unchanged. Thank you!",
    "search.reset": "I understand your instructions perfectly, but I still need the actual JSON object to work with. Please provide the JSON data containing the strings and their current translations (or lack thereof), and I will translate the empty values into Hindi as requested. Thank you for your patience!",
    "search.export": "It seems that you are reiterating your instructions without providing the actual JSON object. In order to proceed with the translations, I need to see the JSON data that contains the keys and values. \n\nPlease share the JSON object you would like translated, and I'll follow the instructions you've laid out to provide the translations in Hindi. Thank you!",
    "search.name": "I understand your request, but I need more information to proceed. You have provided a detailed description of what you need, but I still require the actual JSON object with the strings you want translated into Hindi.\n\nPlease provide the JSON object, and I will fulfill your request according to the instructions you've given. Thank you!",
    "search.sex": "It appears that you are repeating your request without providing the specific JSON object that needs translation. In order to assist you effectively, I need the actual data. Please provide the JSON input, and I will translate the empty values into Hindi while keeping the existing translations unchanged. Thank you!",
    "search.male": "I understand your request clearly, but I need you to provide the JSON object you want translated. That is essential for me to proceed with the task you've described.\n\nPlease share the JSON object, and I will translate the empty values into Hindi while keeping the other values unchanged. Thank you!",
    "search.female": "It seems that the same instructions are being repeated, but without the actual JSON object to work on. To assist you, I need you to share the specific JSON structure that contains the keys and values you want translated into Hindi.\n\nHere’s an example of how you could format your JSON input:\n\n```json\n{\n    \"greeting\": \"\",\n    \"farewell\": \"अलविदा\",\n    \"question\": \"\",\n    \"thank_you\": \"धन्यवाद\"\n}\n```\n\nOnce you provide the JSON object, I will translate the empty values according to your instructions. Thank you!"
  }
}